Tekla Open API Reference for Tekla Structures 2025
Integer Implicit Conversion Operators
Overload List
Name | Description
Implicit(Int32 to Integer)
 Converts from int to Datatype.Integer.
Implicit(Integer to Int32)
 Converts from Datatype.Integer to int.
Top
See Also
Reference
Integer Structure
Tekla.Structures.Datatype Namespace